# Bad hash syntax
> a: 1,
{1,5} Unfinished hash
# Hash, public { a:1 }
> a: 2
{ "m": 2 }
# Hash, public { a:2, b:3 }
>   a: 2  
>   b: 3
{"a": 2, "b": 3}
# Hash, public { a: 3 }, private { b: 2 }
>   @b = 2
>   a: 3
# Hash, public { a: 3 }, private { b: 2 }
>   @b = 2
>   a: 3
# Assignment and Retrieval
> a = 5
> a
5
# Function, minimal example
> fn = () -> 1
> fn
1
# Assignment
> a = 5
> a
5
# Number, addition operator
> 1 + 2
3
# Number, subtraction operator
> 3.490 - 0.31
3.18
